{
	"m_DescList":[
		"В соответствии с требованиями политики, при предоставлении онлайн-услуг пользователям в материковом Китае, программное обеспечение должно запрашивать ввод номера удостоверения личности резидента (Resident Identity Card).",
		"Как правило, клиентская сторона сначала выполняет базовую проверку введенного номера удостоверения, прежде чем передать его на сервер.",
		"",
		"Номер удостоверения личности резидента обычно состоит из 18 символов:",
		"<color=#3c3cff>123456</color><color=#e06600>78901234</color><color=#ee3300>567</color><color=#33aa55>8</color>",
		"Цифры <color=#3c3cff>1-6</color>: Код адреса (Address code)",
		"Цифры <color=#e06600>7-14</color>: Код даты рождения (Date of birth code)",
		"Например, <color=#e06600>78901234</color> означает 31 декабря 7890 года",
		"Например, <color=#e06600>19990102</color> означает 2 января 1999 года",
		"Цифры <color=#ee3300>15-17</color>: Код последовательности (Sequence code)",
		"Цифра <color=#33aa55>18</color>: Контрольная цифра (Check digit) - цифра или заглавная буква X",
		"",
		"Основываясь на здравом смысле, можно сформулировать следующие правила проверки:",
		"1.  В году 12 месяцев, поэтому значение месяца должно быть в диапазоне от 1 до 12.",
		"2.  В каждом месяце может быть 29, 30 или 31 день, поэтому значение дня должно быть в диапазоне от 1 до 31.",
		"3.  Первые две цифры года должны быть 19 или 20.",
		"4.  Общая длина должна составлять 18 символов (или 17 цифр + X).",
		"5.  Контрольная цифра должна быть цифрой или заглавной буквой X.",
		"",
		"Для упрощения расчетов принимаются следующие соглашения:",
		"1.  Не проверяется точное количество дней в конкретном месяце. Год, месяц и день проверяются отдельно. Например, хотя в феврале нет 30-го дня, ввод кода даты рождения 19990230 будет считаться успешным.",
		"2.  Код адреса и код последовательности проверяются только на наличие цифр, без дополнительных проверок.",
		"",
		"",
		"Пожалуйста, составьте регулярное выражение, которое пройдет все тесты справа."
	],
	"m_SystemLanguage":"Russian"
}