{
	"m_DescList":[
		"Богатые Emoji делают общение более живым.  ",
		"Однако, к сожалению, поддержка Emoji в программном обеспечении не является бесплатной.  ",
		"",
		"Периодически выпускаются <b>новые определения Emoji</b>, и некоторым программам часто не хватает времени адаптироваться к ним.  ",
		"<img src=Texture/Task/EmojiNewIcon width=788 height=404>  ",
		"",
		"Иногда <b>мобильные приложения могут аварийно завершать работу</b> при попытке отобразить неподдерживаемый Emoji.  ",
		"Известно, что существует <b>более 3000 Emoji</b>; мы выбрали 20 из них и попытаемся отфильтровать их с помощью регулярных выражений.  ",
		"",
		"Для <b>сложных регулярных выражений</b> существуют различия в эффективности выполнения.  ",
		"Например:  ",
		"<color=#3173FF>[</color><color=#AB2800>12</color><color=#3173FF>][</color><color=#AB2800>34</color><color=#3173FF>][</color><color=#AB2800>56</color><color=#3173FF>]</color> перечисляет возможности для трех последовательных цифр, <b>сначала проверяется первая цифра</b>. Если первая цифра не совпадает, сопоставление завершается неудачей.  ",
		"<color=#05C3BA>(</color><color=#AB2800>135 </color><color=#05C3BA>| </color><color=#AB2800>136 </color><color=#05C3BA>| </color><color=#AB2800>145 </color><color=#05C3BA>| </color><color=#AB2800>156 </color><color=#05C3BA>| </color><color=#AB2800>235 </color><color=#05C3BA>| </color><color=#AB2800>236 </color><color=#05C3BA>| </color><color=#AB2800>245 </color><color=#05C3BA>| </color><color=#AB2800>246</color><color=#05C3BA>)</color>  ",
		"перечисляет все возможности, требуя <b>перебора всех вариантов</b> во время сопоставления, что занимает больше времени.  ",
		"",
		"<color=#666666>Первоначальное задание требовало отфильтровать все Emoji. Из-за чрезмерной сложности задача была переработана.</color>  ",
		"<color=#666666>Для настоящих смельчаков я подготовил 1910 Emoji. Путь к файлу: Путь_установки_игры/StreamingAssets/FullEmoji.txt</color>  ",
		"<color=#666666>Если вы попытаетесь отфильтровать все Emoji с помощью регулярного выражения, <b>лучше напишите код</b>, который поможет вам выполнить эту задачу.</color>  ",
		"",
		"<b>Для всех тестовых случаев</b> действуют следующие соглашения:  ",
		"1.  За исключением первых двух тестовых случаев, каждый содержит только один Emoji.  ",
		"2.  За исключением первых двух тестовых случаев, каждый случай сначала отображает свою escape-последовательность \\uxxxx, затем пробел, а затем сам Emoji.  ",
		"3.  Поскольку компонент Unity Text не может отображать Emoji, символы Emoji остаются невидимыми.  ",
		"",
		"",
		"Пожалуйста, составьте <b>регулярное выражение</b>, которое проходит все тесты справа."
	],
	"m_SystemLanguage":"Russian"
}