{
	"m_DescList":[
		"Rich Emoji expressions hacen que la comunicación sea más atractiva.",
		"",
		"Sin embargo, es lamentable que admitir Emoji en el software no sea algo sin coste.",
		"",
		"Las definiciones de Emoji se actualizan periódicamente, y algunos programas a menudo se retrasan en adaptarse a los nuevos lanzamientos de Emoji.",
		"<img src=Texture/Task/EmojiNewIcon width=788 height=404>",
		"",
		"A veces, los clientes móviles pueden fallar al intentar renderizar Emoji no admitidos.",
		"",
		"Actualmente, existen más de 3.000 Emoji. Hemos seleccionado 20 de ellos e intentaremos filtrarlos usando expresiones regulares.",
		"",
		"Para expresiones regulares complejas, la eficiencia de ejecución varía.",
		"",
		"Por ejemplo:",
		"<color=#3173FF>[</color><color=#AB2800>12</color><color=#3173FF>][</color><color=#AB2800>34</color><color=#3173FF>][</color><color=#AB2800>56</color><color=#3173FF>]</color> enumera las posibilidades de tres dígitos consecutivos, priorizando la coincidencia del primer dígito. Si el primer dígito no coincide, toda la coincidencia falla.",
		"",
		"<color=#05C3BA>(</color><color=#AB2800>135 </color><color=#05C3BA>| </color><color=#AB2800>136 </color><color=#05C3BA>| </color><color=#AB2800>145 </color><color=#05C3BA>| </color><color=#AB2800>156 </color><color=#05C3BA>| </color><color=#AB2800>235 </color><color=#05C3BA>| </color><color=#AB2800>236 </color><color=#05C3BA>| </color><color=#AB2800>245 </color><color=#05C3BA>| </color><color=#AB2800>246</color><color=#05C3BA>)</color> enumera todas las posibilidades, requiriendo recorrer todas las opciones durante la coincidencia, lo que es más lento.",
		"",
		"<color=#666666>El desafío original requería filtrar todos los Emoji. Debido a su dificultad excesiva, la tarea ha sido rediseñada.</color>",
		"",
		"<color=#666666>Para los guerreros realmente valientes, he preparado 1.910 Emoji en: ruta de instalación del juego/StreamingAssets/FullEmoji.txt</color>",
		"",
		"<color=#666666>Si intentas filtrar todos los Emoji mediante regex, es mejor escribir código para automatizar esta tarea</color>",
		"",
		"Para todos los casos de prueba, se aplican las siguientes convenciones:",
		"1. Excepto los dos primeros casos de prueba, cada uno contiene solo un Emoji.",
		"2. Excepto los dos primeros casos de prueba, cada uno muestra su secuencia de escape \\uxxxx seguida de un espacio antes del Emoji.",
		"3. Dado que Unity Text no puede mostrar Emoji, los caracteres Emoji no son visibles.",
		"",
		"",
		"Por favor, construye una expresión regular que pase todos los casos de prueba a la derecha."
	],
	"m_SystemLanguage":"Spanish"
}