{
	"m_DescList":[
		"Strings in computers bestaan uit het ene karakter na het andere. Afhankelijk van verschillende coderingsformaten, wordt dezelfde string bewerkt tot verschillende binaire gegevens. Voor de eenvoud is het standaard coderingsformaat in de volgende tekst <b>Unicode</b>.",
		"",
		"Bijvoorbeeld, het tekenpunt <color=#AB2800>\\u0031</color> komt overeen met het cijfer <color=#3c3cff>1</color>.",
		"<color=#AB2800>\\u</color> staat voor een Unicode-teken, en de daaropvolgende 4 hexadecimale cijfers geven een tekenpunt aan.",
		"",
		"Bijvoorbeeld, drie opeenvolgende tekenpunten <color=#AB2800>\\u0031\\u0032\\u0033</color> komen overeen met de string <color=#3c3cff>123</color>.",
		"",
		"Vanuit het oogpunt van strings en karakters zijn Emoji's geen magische afbeeldingen; ze zijn in de computer in wezen speciale Unicode-karakters.",
		"",
		"De essentie van Emoji's is karakters. Een zichtbare Emoji bestaat uit een of meer gecombineerde karakters. Hieronder staan drie Emoji-voorbeelden.",
		"<color=#AB2800>\\uD83D\\uDE04</color>",
		"<img src=Texture/Emoji/SmillFace width=72 height=72>",
		"<color=#AB2800>\\u2763</color>",
		"<img src=Texture/Emoji/Heart width=72 height=72>",
		"<color=#AB2800>\\u2764\\uFE0F\\u200D\\uD83D\\uDD25</color>",
		"<img src=Texture/Emoji/FireHeart width=72 height=72>",
		"",
		"Meer Emoji-symbolen en hun bijbehorende punten zijn te vinden op de onderstaande website.",
		"[Emoji-collectie](https://www.emojiall.com/zh-hans/all-emojis)",
		"",
		"In reguliere expressies kan <color=#AB2800>\\u0000</color> worden gebruikt om een tekenpunt expliciet te refereren.",
		"",
		"<b>Aangezien Unity's UI.Text geen Emoji's kan weergeven, bekijk de testgevallen alstublieft in de escape-modus</b>",
		"Het doel is nu om enkele voorbereide Emoji-karakters te matchen. Volg alstublieft het onderstaande formaat nauwkeurig om ze te matchen:",
		"<color=#05C3BA>(</color><color=#AB2800>\\uxxxx </color><color=#05C3BA>| </color><color=#AB2800>\\uxxxx </color><color=#05C3BA>| </color><color=#AB2800>\\uxxxx \\uxxxx</color><color=#05C3BA>)</color>",
		"",
		"Voor alle testgevallen gelden de volgende afspraken:",
		"1. Elk testgeval bevat slechts één Emoji.",
		"2. Elk testgeval begint met het escape-karakter \\uxxxx, gevolgd door een spatie, en dan de Emoji.",
		"3. Omdat Unity Text geen Emoji's kan weergeven, zijn de Emoji-karakters onzichtbaar.",
		"",
		"",
		"Construeer een reguliere expressie die alle testen aan de rechterkant doorstaat."
	],
	"m_SystemLanguage":"Dutch"
}