{
	"m_DescList":[
		"Strings in computers are composed of one character after another. Depending on different encoding formats, the same string will be encoded into different binary data. For simplicity, the default encoding format in the following text is <b>Unicode</b>.",
		"",
		"For example, the character point <color=#AB2800>\\u0031</color> corresponds to the number <color=#3c3cff>1</color>.",
		"<color=#AB2800>\\u</color> represents a Unicode character, and the following 4 hexadecimal digits represent a character point.",
		"",
		"For example, three consecutive character points <color=#AB2800>\\u0031\\u0032\\u0033</color> correspond to the string <color=#3c3cff>123</color>.",
		"",
		"From the perspective of strings and characters, Emojis are not magical images; they are essentially special Unicode characters inside computers.",
		"",
		"The essence of Emojis is characters. A visible Emoji is composed of one or more characters. Below are three examples of Emojis.",
		"<color=#AB2800>\\uD83D\\uDE04</color>",
		"<img src=Texture/Emoji/SmillFace width=72 height=72>",
		"<color=#AB2800>\\u2763</color>",
		"<img src=Texture/Emoji/Heart width=72 height=72>",
		"<color=#AB2800>\\u2764\\uFE0F\\u200D\\uD83D\\uDD25</color>",
		"<img src=Texture/Emoji/FireHeart width=72 height=72>",
		"",
		"For more Emoji symbols and their corresponding points, you can check the following website.",
		"[Emoji Collection](https://www.emojiall.com/zh-hans/all-emojis)",
		"",
		"In regular expressions, you can use <color=#AB2800>\\u0000</color> to forcibly reference a character point.",
		"",
		"<b>Since Unity's UI.Text cannot display Emojis, please view the test cases in escape mode.</b>",
		"We now expect to match some prepared Emoji characters. Please imitate the following format to match them precisely:",
		"<color=#05C3BA>(</color><color=#AB2800>\\uxxxx </color><color=#05C3BA>| </color><color=#AB2800>\\uxxxx </color><color=#05C3BA>| </color><color=#AB2800>\\uxxxx \\uxxxx</color><color=#05C3BA>)</color>",
		"",
		"For all test cases, the following conventions are made:",
		"1. Each test case contains only one Emoji.",
		"2. Each test case first inputs the escape character \\uxxxx, followed by a space, and then the Emoji.",
		"3. Since Unity Text cannot display Emojis, this causes the Emoji characters to be invisible.",
		"",
		"",
		"Please construct a regular expression that passes all the tests on the right."
	],
	"m_SystemLanguage":"English"
}