{
	"m_DescList":[
		"Les chaînes de caractères sont composées d'une succession de caractères en informatique. Selon le format d'encodage, une même chaîne sera traduite en différentes données binaires. Pour simplifier, nous considérerons par défaut le format <b>Unicode</b> dans la suite.",
		"",
		"Par exemple, le point de code <color=#AB2800>\\u0031</color> correspond au chiffre <color=#3c3cff>1</color>.",
		"<color=#AB2800>\\u</color> représente un caractère Unicode, suivi de 4 chiffres hexadécimaux désignant un point de code.",
		"",
		"Par exemple, trois points de code consécutifs <color=#AB2800>\\u0031\\u0032\\u0033</color> correspondent à la chaîne <color=#3c3cff>123</color>.",
		"",
		"D'un point de vue technique, les Emojis ne sont pas des images magiques : ils correspondent fondamentalement à des caractères Unicode spéciaux dans l'ordinateur.",
		"",
		"Les Emojis sont essentiellement des caractères. Un Emoji visible est composé d'un ou plusieurs caractères combinés. Voici trois exemples :",
		"<color=#AB2800>\\uD83D\\uDE04</color>",
		"<img src=Texture/Emoji/SmillFace width=72 height=72>",
		"<color=#AB2800>\\u2763</color>",
		"<img src=Texture/Emoji/Heart width=72 height=72>",
		"<color=#AB2800>\\u2764\\uFE0F\\u200D\\uD83D\\uDD25</color>",
		"<img src=Texture/Emoji/FireHeart width=72 height=72>",
		"",
		"Plus de symboles Emoji et leurs points de code correspondants sont disponibles sur :",
		"[Collection complète d'Emoji](https://www.emojiall.com/zh-hans/all-emojis)",
		"",
		"Dans les expressions régulières, on utilise <color=#AB2800>\\u0000</color> pour référencer explicitement un point de code.",
		"",
		"<b>Le composant UI.Text d'Unity ne pouvant afficher les Emojis, veuillez consulter les cas de test en mode échappement</b>",
		"Objectif : faire correspondre des caractères Emoji préparés selon ce format précis :",
		"<color=#05C3BA>(</color><color=#AB2800>\\uxxxx </color><color=#05C3BA>| </color><color=#AB2800>\\uxxxx </color><color=#05C3BA>| </color><color=#AB2800>\\uxxxx \\uxxxx</color><color=#05C3BA>)</color>",
		"",
		"Conventions pour tous les cas de test :",
		"1. Chaque cas contient un seul Emoji",
		"2. Format : caractère d'échappement \\uxxxx + espace + Emoji",
		"3. Les Emojis sont invisibles dans Unity Text",
		"",
		"",
		"Veuillez construire une expression régulière validant tous les tests à droite."
	],
	"m_SystemLanguage":"French"
}