{
	"m_DescList":[
		"Zeichenketten (Strings) bestehen im Computer aus einer Folge von Zeichen. Abhängig vom verwendeten Kodierungsformat wird dieselbe Zeichenkette in unterschiedliche Binärdaten umgewandelt. Der Einfachheit halber wird im Folgenden standardmäßig das <b>Unicode</b>-Format angenommen.",
		"",
		"Beispielsweise entspricht der Codepoint <color=#AB2800>\\u0031</color> der Zahl <color=#3c3cff>1</color>.",
		"<color=#AB2800>\\u</color> steht für ein Unicode-Zeichen, wobei die folgenden 4 hexadezimalen Ziffern einen spezifischen Codepoint repräsentieren.",
		"",
		"Beispielsweise entsprechen drei aufeinanderfolgende Codepoints <color=#AB2800>\\u0031\\u0032\\u0033</color> der Zeichenkette <color=#3c3cff>123</color>.",
		"",
		"Aus Sicht von Zeichenketten und Zeichen sind Emojis keine magischen Bilder. Im Inneren des Computers sind sie im Wesentlichen spezielle Unicode-Zeichen.",
		"",
		"Das Wesen von Emojis sind Zeichen. Ein sichtbares Emoji besteht aus einem oder mehreren kombinierten Zeichen. Hier sind drei Emoji-Beispiele:",
		"<color=#AB2800>\\uD83D\\uDE04</color>",
		"<img src=Texture/Emoji/SmillFace width=72 height=72>",
		"<color=#AB2800>\\u2763</color>",
		"<img src=Texture/Emoji/Heart width=72 height=72>",
		"<color=#AB2800>\\u2764\\uFE0F\\u200D\\uD83D\\uDD25</color>",
		"<img src=Texture/Emoji/FireHeart width=72 height=72>",
		"",
		"Weitere Emoji-Symbole und ihre entsprechenden Codepoints können auf der folgenden Website nachgeschlagen werden:",
		"[Emoji-Sammlung](https://www.emojiall.com/zh-hans/all-emojis)",
		"",
		"In regulären Ausdrücken kann <color=#AB2800>\\u0000</color> verwendet werden, um die Referenzierung eines bestimmten Codepoints zu erzwingen.",
		"",
		"<b>Da Unitys UI.Text keine Emojis anzeigen kann, bitte die Testfälle im Escapemodus betrachten.</b>",
		"Ziel ist es nun, einige vorbereitete Emoji-Zeichen zu matchen. Bitte imitiere das folgende Format, um sie exakt zu matchen:",
		"<color=#05C3BA>(</color><color=#AB2800>\\uxxxx </color><color=#05C3BA>| </color><color=#AB2800>\\uxxxx </color><color=#05C3BA>| </color><color=#AB2800>\\uxxxx \\uxxxx</color><color=#05C3BA>)</color>",
		"",
		"Für alle Testfälle gelten folgende Vereinbarungen:",
		"1. Jeder Testfall enthält nur ein einziges Emoji.",
		"2. Jeder Testfall beginnt mit der Escape-Sequenz \\uxxxx, gefolgt von einem Leerzeichen und dann dem Emoji.",
		"3. Da Unity Text Emojis nicht darstellen kann, sind die Emoji-Zeichen nicht sichtbar.",
		"",
		"",
		"Bitte konstruiere einen regulären Ausdruck, der alle Testfälle auf der rechten Seite besteht."
	],
	"m_SystemLanguage":"German"
}