{
	"m_DescList":[
		"Łańcuchy znaków w komputerach składają się z kolejnych znaków. W zależności od różnych formatów kodowania, ten sam łańcuch zostanie zakodowany w różne dane binarne. Dla uproszczenia, domyślnym formatem kodowania w dalszej części tekstu jest <b>Unicode</b>.",
		"",
		"Na przykład, punkt znaku <color=#AB2800>\\u0031</color> odpowiada cyfrze <color=#3c3cff>1</color>.",
		"<color=#AB2800>\\u</color> reprezentuje znak Unicode, a następujące po nim 4 cyfry szesnastkowe reprezentują punkt znaku.",
		"",
		"Na przykład, trzy kolejne punkty znaków <color=#AB2800>\\u0031\\u0032\\u0033</color> odpowiadają łańcuchowi <color=#3c3cff>123</color>.",
		"",
		"Z perspektywy łańcuchów i znaków, Emoji nie są magicznymi obrazkami; w istocie są specjalnymi znakami Unicode wewnątrz komputerów.",
		"",
		"Istotą Emoji są znaki. Widoczne Emoji składają się z jednego lub więcej znaków. Poniżej znajdują się trzy przykłady Emoji:",
		"<color=#AB2800>\\uD83D\\uDE04</color>",
		"<img src=Texture/Emoji/SmillFace width=72 height=72>",
		"<color=#AB2800>\\u2763</color>",
		"<img src=Texture/Emoji/Heart width=72 height=72>",
		"<color=#AB2800>\\u2764\\uFE0F\\u200D\\uD83D\\uDD25</color>",
		"<img src=Texture/Emoji/FireHeart width=72 height=72>",
		"",
		"Więcej symboli Emoji i odpowiadających im punktów można znaleźć na stronie:",
		"[Pełna kolekcja Emoji](https://www.emojiall.com/zh-hans/all-emojis)",
		"",
		"W wyrażeniach regularnych można użyć <color=#AB2800>\\u0000</color>, aby wymusić odwołanie się do punktu znaku.",
		"",
		"<b>Ponieważ UI.Text w Unity nie może wyświetlać Emoji, proszę przeglądać przypadki testowe w trybie escape.</b>",
		"Oczekujemy teraz dopasowania przygotowanych znaków Emoji. Proszę naśladować poniższy format, aby precyzyjnie je dopasować:",
		"<color=#05C3BA>(</color><color=#AB2800>\\uxxxx </color><color=#05C3BA>| </color><color=#AB2800>\\uxxxx </color><color=#05C3BA>| </color><color=#AB2800>\\uxxxx \\uxxxx</color><color=#05C3BA>)</color>",
		"",
		"Dla wszystkich przypadków testowych przyjęto następujące konwencje:",
		"1. Każdy przypadek testowy zawiera tylko jedno Emoji.",
		"2. Każdy przypadek testowy najpierw wprowadza znak escape \\uxxxx, po którym następuje spacja, a następnie Emoji.",
		"3. Ponieważ Unity Text nie może wyświetlać Emoji, znaki Emoji są niewidoczne.",
		"",
		"",
		"Proszę skonstruować wyrażenie regularne, które przejdzie wszystkie testy po prawej stronie."
	],
	"m_SystemLanguage":"Polish"
}