{
	"m_DescList":[
		"Strings em computadores são compostas por um caractere após o outro. Dependendo de diferentes formatos de codificação, a mesma string será codificada em dados binários diferentes. Para simplificar, o formato de codificação padrão no texto a seguir é <b>Unicode</b>.  ",
		"",
		"Por exemplo, o ponto de caractere <color=#AB2800>\\u0031</color> corresponde ao número <color=#3c3cff>1</color>.  ",
		"<color=#AB2800>\\u</color> representa um caractere Unicode, e os 4 dígitos hexadecimais seguintes representam um ponto de caractere.  ",
		"",
		"Por exemplo, três pontos de caractere consecutivos <color=#AB2800>\\u0031\\u0032\\u0033</color> correspondem à string <color=#3c3cff>123</color>.  ",
		"",
		"Sob a perspectiva de strings e caracteres, Emojis não são imagens mágicas; eles são essencialmente caracteres Unicode especiais dentro do computador.  ",
		"",
		"A essência dos Emojis são caracteres. Um Emoji visível é composto por um ou mais caracteres. Abaixo estão três exemplos de Emojis:  ",
		"<color=#AB2800>\\uD83D\\uDE04</color>  ",
		"<img src=Texture/Emoji/SmillFace width=72 height=72>  ",
		"<color=#AB2800>\\u2763</color>  ",
		"<img src=Texture/Emoji/Heart width=72 height=72>  ",
		"<color=#AB2800>\\u2764\\uFE0F\\u200D\\uD83D\\uDD25</color>  ",
		"<img src=Texture/Emoji/FireHeart width=72 height=72>  ",
		"",
		"Para mais símbolos de Emoji e seus pontos correspondentes, consulte o site:  ",
		"[Emoji Collection](https://www.emojiall.com/zh-hans/all-emojis)  ",
		"",
		"Em expressões regulares, você pode usar <color=#AB2800>\\u0000</color> para referenciar forçosamente um ponto de caractere.  ",
		"",
		"<b>Como o UI.Text do Unity não pode exibir Emojis, visualize os casos de teste no modo de escape.</b>  ",
		"Agora esperamos combinar alguns caracteres de Emoji preparados. Por favor, imite o seguinte formato para combiná-los com precisão:  ",
		"<color=#05C3BA>(</color><color=#AB2800>\\uxxxx </color><color=#05C3BA>| </color><color=#AB2800>\\uxxxx </color><color=#05C3BA>| </color><color=#AB2800>\\uxxxx \\uxxxx</color><color=#05C3BA>)</color>  ",
		"",
		"Para todos os casos de teste, as seguintes convenções são adotadas:  ",
		"1. Cada caso de teste contém apenas um Emoji.  ",
		"2. Cada caso de teste primeiro insere o caractere de escape \\uxxxx, seguido por um espaço, e depois o Emoji.  ",
		"3. Como o Unity Text não pode exibir Emojis, isso faz com que os caracteres de Emoji fiquem invisíveis.  ",
		"",
		"",
		"Por favor, construa uma expressão regular que passe em todos os testes à direita."
	],
	"m_SystemLanguage":"Portuguese"
}