{
	"m_DescList":[
		"Строки в компьютерах состоят из одного символа за другим. В зависимости от разных форматов кодирования одна и та же строка будет закодирована в различные двоичные данные. Для упрощения в дальнейшем тексте по умолчанию используется формат кодирования <b>Unicode</b>.",
		"",
		"Например, кодовая точка символа <color=#AB2800>\\u0031</color> соответствует цифре <color=#3c3cff>1</color>.",
		"<color=#AB2800>\\u</color> обозначает символ Unicode, а следующие за ним 4 шестнадцатеричные цифры представляют кодовую точку символа.",
		"",
		"Например, три последовательные кодовые точки <color=#AB2800>\\u0031\\u0032\\u0033</color> соответствуют строке <color=#3c3cff>123</color>.",
		"",
		"С точки зрения строк и символов, эмодзи — это не волшебные картинки; по своей сути внутри компьютера они являются специальными символами Unicode.",
		"",
		"Сущность эмодзи — это символы. Видимый эмодзи состоит из одного или нескольких символов. Ниже приведены три примера эмодзи.",
		"<color=#AB2800>\\uD83D\\uDE04</color>",
		"<img src=Texture/Emoji/SmillFace width=72 height=72>",
		"<color=#AB2800>\\u2763</color>",
		"<img src=Texture/Emoji/Heart width=72 height=72>",
		"<color=#AB2800>\\u2764\\uFE0F\\u200D\\uD83D\\uDD25</color>",
		"<img src=Texture/Emoji/FireHeart width=72 height=72>",
		"",
		"Больше символов эмодзи и их соответствующих кодовых точек можно найти на следующем сайте.",
		"[Все Эмодзи](https://www.emojiall.com/zh-hans/all-emojis)",
		"",
		"В регулярных выражениях можно использовать <color=#AB2800>\\u0000</color> для принудительной ссылки на кодовую точку символа.",
		"",
		"<b>Поскольку UI.Text Unity не может отображать эмодзи, пожалуйста, просматривайте тестовые примеры в режиме экранирования.</b>",
		"Теперь требуется сопоставить некоторые подготовленные символы эмодзи. Пожалуйста, точно сопоставьте их, имитируя следующий формат:",
		"<color=#05C3BA>(</color><color=#AB2800>\\uxxxx </color><color=#05C3BA>| </color><color=#AB2800>\\uxxxx </color><color=#05C3BA>| </color><color=#AB2800>\\uxxxx \\uxxxx</color><color=#05C3BA>)</color>",
		"",
		"Для всех тестовых примеров действуют следующие соглашения:",
		"1. Каждый тестовый пример содержит только один эмодзи.",
		"2. Каждый тестовый пример сначала содержит экранирующую последовательность \\uxxxx, затем пробел, а затем эмодзи.",
		"3. Поскольку Unity Text не может отображать эмодзи, символы эмодзи становятся невидимыми.",
		"",
		"",
		"Пожалуйста, составьте регулярное выражение, которое пройдет все тесты справа."
	],
	"m_SystemLanguage":"Russian"
}