{
	"m_DescList":[
		"Las cadenas en informática están compuestas por un carácter tras otro. Según el formato de codificación, la misma cadena se codificará en datos binarios diferentes. Para simplificar, el formato de codificación predeterminado en el siguiente texto es <b>Unicode</b>.",
		"",
		"Por ejemplo, el punto de código <color=#AB2800>\\u0031</color> corresponde al número <color=#3c3cff>1</color>.",
		"<color=#AB2800>\\u</color> representa un carácter Unicode, y los siguientes 4 dígitos hexadecimales representan un punto de código.",
		"",
		"Por ejemplo, tres puntos de código consecutivos <color=#AB2800>\\u0031\\u0032\\u0033</color> corresponden a la cadena <color=#3c3cff>123</color>.",
		"",
		"Desde la perspectiva de las cadenas y los caracteres, los Emojis no son imágenes mágicas; en esencia, dentro de la computadora son caracteres Unicode especiales.",
		"",
		"La esencia de los Emojis son caracteres. Un Emoji visible está compuesto por uno o más caracteres. A continuación hay tres ejemplos de Emojis.",
		"<color=#AB2800>\\uD83D\\uDE04</color>",
		"<img src=Texture/Emoji/SmillFace width=72 height=72>",
		"<color=#AB2800>\\u2763</color>",
		"<img src=Texture/Emoji/Heart width=72 height=72>",
		"<color=#AB2800>\\u2764\\uFE0F\\u200D\\uD83D\\uDD25</color>",
		"<img src=Texture/Emoji/FireHeart width=72 height=72>",
		"",
		"Puedes consultar más símbolos Emoji y sus puntos de código correspondientes en el siguiente sitio web.",
		"[Todo sobre Emojis](https://www.emojiall.com/zh-hans/all-emojis)",
		"",
		"En expresiones regulares, puedes usar <color=#AB2800>\\u0000</color> para hacer referencia forzada a un punto de código de carácter.",
		"",
		"<b>Dado que UI.Text de Unity no puede mostrar Emojis, por favor visualiza los casos de prueba en modo de escape.</b>",
		"Ahora esperamos hacer coincidir algunos caracteres Emoji preparados. Por favor, imita el siguiente formato para hacer coincidirlos con precisión:",
		"<color=#05C3BA>(</color><color=#AB2800>\\uxxxx </color><color=#05C3BA>| </color><color=#AB2800>\\uxxxx </color><color=#05C3BA>| </color><color=#AB2800>\\uxxxx \\uxxxx</color><color=#05C3BA>)</color>",
		"",
		"Para todos los casos de prueba, se establecen las siguientes convenciones:",
		"1. Cada caso de prueba contiene solo un Emoji.",
		"2. Cada caso de prueba primero ingresa el carácter de escape \\uxxxx, seguido de un espacio, y luego el Emoji.",
		"3. Dado que Unity Text no puede mostrar Emojis, esto hace que los caracteres Emoji sean invisibles.",
		"",
		"",
		"Por favor, construye una expresión regular que pase todas las pruebas a la derecha."
	],
	"m_SystemLanguage":"Spanish"
}