{
	"m_DescList":[
		"Bilgisayarlarda dizgiler (strings), birbirini takip eden karakterlerden oluşur. Farklı kodlama biçimlerine bağlı olarak, aynı dizi farklı ikili veriye dönüştürülür. Basitleştirmek için, aşağıdaki metinde varsayılan kodlama biçimi <b>Unicode</b> olarak kabul edilmiştir.",
		"",
		"Örneğin, karakter konumu <color=#AB2800>\\u0031</color>, <color=#3c3cff>1</color> rakamına karşılık gelir.",
		"<color=#AB2800>\\u</color>, bir Unicode karakterini temsil eder; ardından gelen 4 haneli onaltılık (hexadecimal) sayı bir karakter konumunu belirtir.",
		"",
		"Örneğin, ardışık 3 karakter konumu <color=#AB2800>\\u0031\\u0032\\u0033</color>, <color=#3c3cff>123</color> dizgisine karşılık gelir.",
		"",
		"Dizgiler ve karakterler açısından bakıldığında, Emoji'ler sihirli resimler değildir; bilgisayarın içinde özünde özel Unicode karakterleridir.",
		"",
		"Emoji'lerin özü karakterdir. Görünür bir Emoji, bir veya daha fazla karakterin birleşiminden oluşur. Aşağıda 3 Emoji örneği verilmiştir.",
		"<color=#AB2800>\\uD83D\\uDE04</color>",
		"<img src=Texture/Emoji/SmillFace width=72 height=72>",
		"<color=#AB2800>\\u2763</color>",
		"<img src=Texture/Emoji/Heart width=72 height=72>",
		"<color=#AB2800>\\u2764\\uFE0F\\u200D\\uD83D\\uDD25</color>",
		"<img src=Texture/Emoji/FireHeart width=72 height=72>",
		"",
		"Daha fazla Emoji sembolü ve bunlara karşılık gelen konumlar için aşağıdaki web sitesine başvurabilirsiniz.",
		"[Emoji Koleksiyonu](https://www.emojiall.com/zh-hans/all-emojis)",
		"",
		"Düzenli ifadelerde, bir karakter konumunu zorunlu olarak referans almak için <color=#AB2800>\\u0000</color> kullanılabilir.",
		"",
		"<b>Unity'nin UI.Text bileşeni Emoji'leri gösteremediği için, lütfen test senaryolarını kaçış (escape) modunda görüntüleyin.</b>",
		"Şimdi, önceden hazırlanmış bazı Emoji karakterlerini eşleştirmek istiyoruz. Lütfen onları tam olarak eşleştirmek için aşağıdaki biçimi taklit edin:",
		"<color=#05C3BA>(</color><color=#AB2800>\\uxxxx </color><color=#05C3BA>| </color><color=#AB2800>\\uxxxx </color><color=#05C3BA>| </color><color=#AB2800>\\uxxxx \\uxxxx</color><color=#05C3BA>)</color>",
		"",
		"Tüm test senaryoları için aşağıdaki kurallar geçerlidir:",
		"1. Her test senaryosu yalnızca <b>bir</b> Emoji içerir.",
		"2. Her test senaryosu önce kaçış karakteri \\uxxxx girişi, ardından bir <b>boşluk</b>, sonra da Emoji girişi şeklindedir.",
		"3. Unity Text'in Emoji'leri gösterememesi nedeniyle, Emoji karakterleri görünmez olur.",
		"",
		"",
		"Lütfen sağdaki tüm testleri geçecek bir düzenli ifade oluşturun."
	],
	"m_SystemLanguage":"Turkish"
}