{
	"m_DescList":[
		"El Protocolo de Transferencia de Hipertexto (HTTP) es el protocolo base para la interacción de datos entre el navegador y el servidor. <color=#3c3cff>http://</color><color=#666666>google.com</color> representa el significado del Protocolo de Transferencia de Hipertexto.",
		"",
		"Esencialmente, este protocolo transmite al servidor un texto con un formato especial. El servidor analiza este texto formateado y responde según el contenido de la solicitud.",
		"",
		"Por ejemplo, esta es la información de una solicitud enviada por un cliente:",
		"",
		"GET /extensions/marketplace.json HTTP/1.1",
		"Host: main.vscode-cdn.net",
		"User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Code/1.99.3 Chrome/132.0.6834.210 Electron/34.3.2 Safari/537.36",
		"Accept-Encoding: gzip, deflate, br, zstd",
		"",
		"",
		"<color=#ee3300>GET</color> es el tipo de solicitud. HTTP incluye varios tipos de solicitudes: GET, POST, DELETE...",
		"<color=#3c3cff>/extensions/marketplace.json</color> es la dirección URL solicitada.",
		"<color=#e06600>HTTP/1.1</color> indica el número de versión HTTP utilizada en esta solicitud.",
		"",
		"<color=#ee3300>Host: </color> indica que este parámetro de línea es la dirección del host.",
		"<color=#3c3cff>main.vscode-cdn.net</color> es la dirección del host de esta solicitud.",
		"",
		"<color=#ee3300>User-Agent: </color> indica que este parámetro de línea es la información del navegador del usuario.",
		"<color=#3c3cff>Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Code/1.99.3 Chrome/132.0.6834.210 Electron/34.3.2 Safari/537.36</color> es la información específica del navegador del usuario.",
		"",
		"<color=#ee3300>Accept-Encoding: </color> indica que este parámetro de línea es la información de codificación que el navegador puede aceptar.",
		"<color=#3c3cff>gzip, deflate, br, zstd</color> son los tipos de codificación que el navegador puede aceptar.",
		"",
		"Ahora se espera extraer el contenido de algunos campos comunes del texto de la solicitud HTTP:",
		"1.  El grupo de captura que coincide con la dirección URL se llama \"url\".",
		"2.  El grupo de captura que coincide con la dirección del host se llama \"host\".",
		"3.  El grupo de captura que coincide con la información del navegador se llama \"user_agent\".",
		"4.  El grupo de captura que coincide con la información de codificación se llama \"accept_encoding\".",
		"5.  Si una línea contiene grupos de captura, entonces coincidir con el contenido de esa línea.",
		"",
		"",
		"Por favor, construya una expresión regular que pase todas las pruebas del lado derecho."
	],
	"m_SystemLanguage":"Spanish"
}