{
	"m_DescList":[
		"Köprü Metni Aktarım Protokolü (HTTP), tarayıcıların sunucularla veri etkileşimi için temel protokoldür. <color=#3c3cff>http://</color><color=#666666>google.com</color> ifadesi, Köprü Metni Aktarım Protokolü'nün anlamını temsil eder.",
		"",
		"Bu protokol, temelde sunucuya özel biçimlendirilmiş bir metin gönderir; sunucu da bu metni ayrıştırır ve istenen içeriğe göre yanıt verir.",
		"",
		"Örneğin, bir istemci tarafından gönderilen bir istek bilgisi şöyledir:",
		"",
		"GET /extensions/marketplace.json HTTP/1.1",
		"Host: main.vscode-cdn.net",
		"User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Code/1.99.3 Chrome/132.0.6834.210 Electron/34.3.2 Safari/537.36",
		"Accept-Encoding: gzip, deflate, br, zstd",
		"",
		"",
		"<color=#ee3300>GET</color> bu isteğin protokol türüdür. HTTP, GET, POST, DELETE... gibi çeşitli istek türlerini içerir.",
		"<color=#3c3cff>/extensions/marketplace.json</color> istenen URL adresidir.",
		"<color=#e06600>HTTP/1.1</color> bu istekte kullanılan HTTP sürüm numarasını belirtir.",
		"",
		"<color=#ee3300>Host: </color> bu satır parametresinin konak (host) adresi olduğunu belirtir.",
		"<color=#3c3cff>main.vscode-cdn.net</color> bu isteğin hedef konak adresidir.",
		"",
		"<color=#ee3300>User-Agent: </color> bu satır parametresinin kullanıcının tarayıcı bilgisi olduğunu belirtir.",
		"<color=#3c3cff>Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Code/1.99.3 Chrome/132.0.6834.210 Electron/34.3.2 Safari/537.36</color> kullanıcının spesifik tarayıcı bilgisidir.",
		"",
		"<color=#ee3300>Accept-Encoding: </color> bu satır parametresinin tarayıcının kabul ettiği kodlama bilgileri olduğunu belirtir.",
		"<color=#3c3cff>gzip, deflate, br, zstd</color> tarayıcının kabul ettiği kodlama bilgileridir.",
		"",
		"Şimdi HTTP istek metninden bazı yaygın alanların içeriğini çıkarmak istiyoruz:",
		"1.  URL adresini eşleştiren yakalama grubunun adı \"url\" olsun.",
		"2.  Konak adresini eşleştiren yakalama grubunun adı \"host\" olsun.",
		"3.  Tarayıcı bilgisini eşleştiren yakalama grubunun adı \"user_agent\" olsun.",
		"4.  Kodlama bilgisini eşleştiren yakalama grubunun adı \"accept_encoding\" olsun.",
		"5.  Bir satırda yakalama grupları varsa, o satırın tamamını eşleştir.",
		"",
		"",
		"Lütfen sağdaki tüm testleri geçecek bir düzenli ifade (regex) oluşturun."
	],
	"m_SystemLanguage":"Turkish"
}